ycsb-script/run_output.txt
[WARNING] 
[WARNING] Some problems were encountered while building the effective settings
[WARNING] Expected root element 'settings' but found 'mirror' (position: START_TAG seen <mirror>... @1:9)  @ /Users/kkkzoz/.m2/settings.xml, line 1, column 9
[WARNING] 
[INFO] Scanning for projects...
[INFO] ------------------------------------------------------------------------
[INFO] Reactor Build Order:
[INFO] 
[INFO] YCSB Root                                                          [pom]
[INFO] Core YCSB                                                          [jar]
[INFO] Per Datastore Binding descriptor                                   [jar]
[INFO] YCSB Datastore Binding Parent                                      [pom]
[INFO] RocksDB Java Binding                                               [jar]
[INFO] 
[INFO] ---------------------------< site.ycsb:root >---------------------------
[INFO] Building YCSB Root 0.17.0                                          [1/5]
[INFO]   from pom.xml
[INFO] --------------------------------[ pom ]---------------------------------
[INFO] 
[INFO] --- enforcer:3.0.0-M1:enforce (enforce-maven) @ root ---
[INFO] 
[INFO] --- checkstyle:2.16:check (validate) @ root ---
[INFO] 
[INFO] --- dependency:3.7.0:list (default-cli) @ root ---
[INFO] 
[INFO] ---------------------------< site.ycsb:core >---------------------------
[INFO] Building Core YCSB 0.17.0                                          [2/5]
[INFO]   from core/pom.xml
[INFO] --------------------------------[ jar ]---------------------------------
[INFO] 
[INFO] --- enforcer:3.0.0-M1:enforce (enforce-maven) @ core ---
[INFO] 
[INFO] --- checkstyle:2.16:check (validate) @ core ---
[INFO] 
[INFO] --- resources:3.3.1:resources (default-resources) @ core ---
[INFO] Copying 1 resource from src/main/resources to target/classes
[INFO] The encoding used to copy filtered properties files have not been set. This means that the same encoding will be used to copy filtered properties files as when copying other filtered resources. This might not be what you want! Run your build with --debug to see which files might be affected. Read more at https://maven.apache.org/plugins/maven-resources-plugin/examples/filtering-properties-files.html
[INFO] 
[INFO] --- compiler:3.7.0:compile (default-compile) @ core ---
[INFO] Changes detected - recompiling the module!
[INFO] Compiling 63 source files to /Users/kkkzoz/Projects/kv-cache-research/ycsb-repo/core/target/classes
[INFO] /Users/kkkzoz/Projects/kv-cache-research/ycsb-repo/core/src/main/java/site/ycsb/Client.java: Some input files use or override a deprecated API.
[INFO] /Users/kkkzoz/Projects/kv-cache-research/ycsb-repo/core/src/main/java/site/ycsb/Client.java: Recompile with -Xlint:deprecation for details.
[INFO] 
[INFO] --- resources:3.3.1:testResources (default-testResources) @ core ---
[INFO] skip non existing resourceDirectory /Users/kkkzoz/Projects/kv-cache-research/ycsb-repo/core/src/test/resources
[INFO] 
[INFO] --- compiler:3.7.0:testCompile (default-testCompile) @ core ---
[INFO] Nothing to compile - all classes are up to date
[INFO] 
[INFO] --- surefire:3.2.5:test (default-test) @ core ---
[INFO] Tests are skipped.
[INFO] 
[INFO] --- jar:3.4.1:jar (default-jar) @ core ---
[INFO] Building jar: /Users/kkkzoz/Projects/kv-cache-research/ycsb-repo/core/target/core-0.17.0.jar
[INFO] 
[INFO] --- dependency:3.7.0:list (default-cli) @ core ---
[INFO] Can't extract module name from htrace-core4-4.1.0-incubating.jar: Provider class com.fasterxml.jackson.core.JsonFactory not in JAR file htrace-core4-4.1.0-incubating.jar
[INFO] 
[INFO] --------------< site.ycsb:datastore-specific-descriptor >---------------
[INFO] Building Per Datastore Binding descriptor 0.17.0                   [3/5]
[INFO]   from binding-parent/datastore-specific-descriptor/pom.xml
[INFO] --------------------------------[ jar ]---------------------------------
[INFO] 
[INFO] --- enforcer:3.0.0-M1:enforce (enforce-maven) @ datastore-specific-descriptor ---
[INFO] 
[INFO] --- checkstyle:2.16:check (validate) @ datastore-specific-descriptor ---
[INFO] 
[INFO] --- resources:3.3.1:resources (default-resources) @ datastore-specific-descriptor ---
[INFO] Copying 1 resource from src/main/resources to target/classes
[INFO] 
[INFO] --- compiler:3.7.0:compile (default-compile) @ datastore-specific-descriptor ---
[INFO] No sources to compile
[INFO] 
[INFO] --- resources:3.3.1:testResources (default-testResources) @ datastore-specific-descriptor ---
[INFO] skip non existing resourceDirectory /Users/kkkzoz/Projects/kv-cache-research/ycsb-repo/binding-parent/datastore-specific-descriptor/src/test/resources
[INFO] 
[INFO] --- compiler:3.7.0:testCompile (default-testCompile) @ datastore-specific-descriptor ---
[INFO] No sources to compile
[INFO] 
[INFO] --- surefire:3.2.5:test (default-test) @ datastore-specific-descriptor ---
[INFO] Tests are skipped.
[INFO] 
[INFO] --- jar:3.4.1:jar (default-jar) @ datastore-specific-descriptor ---
[INFO] 
[INFO] --- dependency:3.7.0:list (default-cli) @ datastore-specific-descriptor ---
[INFO] Can't extract module name from htrace-core4-4.1.0-incubating.jar: Provider class com.fasterxml.jackson.core.JsonFactory not in JAR file htrace-core4-4.1.0-incubating.jar
[INFO] 
[INFO] ----------------------< site.ycsb:binding-parent >----------------------
[INFO] Building YCSB Datastore Binding Parent 0.17.0                      [4/5]
[INFO]   from binding-parent/pom.xml
[INFO] --------------------------------[ pom ]---------------------------------
[INFO] 
[INFO] --- enforcer:3.0.0-M1:enforce (enforce-maven) @ binding-parent ---
[INFO] 
[INFO] --- checkstyle:2.16:check (validate) @ binding-parent ---
[INFO] 
[INFO] --- dependency:2.10:copy-dependencies (stage-dependencies) @ binding-parent ---
[INFO] 
[INFO] --- dependency:2.10:list (default-cli) @ binding-parent ---
[INFO] 
[INFO] ---------------------< site.ycsb:rocksdb-binding >----------------------
[INFO] Building RocksDB Java Binding 0.17.0                               [5/5]
[INFO]   from rocksdb/pom.xml
[INFO] --------------------------------[ jar ]---------------------------------
[INFO] 
[INFO] --- enforcer:3.0.0-M1:enforce (enforce-maven) @ rocksdb-binding ---
[INFO] 
[INFO] --- checkstyle:2.16:check (validate) @ rocksdb-binding ---
[INFO] 
[INFO] --- resources:3.3.1:resources (default-resources) @ rocksdb-binding ---
[INFO] skip non existing resourceDirectory /Users/kkkzoz/Projects/kv-cache-research/ycsb-repo/rocksdb/src/main/resources
[INFO] 
[INFO] --- compiler:3.7.0:compile (default-compile) @ rocksdb-binding ---
[INFO] Changes detected - recompiling the module!
[INFO] Compiling 2 source files to /Users/kkkzoz/Projects/kv-cache-research/ycsb-repo/rocksdb/target/classes
[INFO] /Users/kkkzoz/Projects/kv-cache-research/ycsb-repo/rocksdb/src/main/java/site/ycsb/db/rocksdb/RocksDBClient.java: /Users/kkkzoz/Projects/kv-cache-research/ycsb-repo/rocksdb/src/main/java/site/ycsb/db/rocksdb/RocksDBClient.java uses or overrides a deprecated API.
[INFO] /Users/kkkzoz/Projects/kv-cache-research/ycsb-repo/rocksdb/src/main/java/site/ycsb/db/rocksdb/RocksDBClient.java: Recompile with -Xlint:deprecation for details.
[INFO] 
[INFO] --- resources:3.3.1:testResources (default-testResources) @ rocksdb-binding ---
[INFO] skip non existing resourceDirectory /Users/kkkzoz/Projects/kv-cache-research/ycsb-repo/rocksdb/src/test/resources
[INFO] 
[INFO] --- compiler:3.7.0:testCompile (default-testCompile) @ rocksdb-binding ---
[INFO] Nothing to compile - all classes are up to date
[INFO] 
[INFO] --- surefire:3.2.5:test (default-test) @ rocksdb-binding ---
[INFO] Tests are skipped.
[INFO] 
[INFO] --- jar:3.4.1:jar (default-jar) @ rocksdb-binding ---
[INFO] Building jar: /Users/kkkzoz/Projects/kv-cache-research/ycsb-repo/rocksdb/target/rocksdb-binding-0.17.0.jar
[INFO] 
[INFO] --- dependency:2.10:copy-dependencies (stage-dependencies) @ rocksdb-binding ---
[INFO] org.slf4j:slf4j-api:jar:1.7.25 already exists in destination.
[INFO] org.rocksdb:rocksdbjni:jar:6.29.5 already exists in destination.
[INFO] net.jcip:jcip-annotations:jar:1.0 already exists in destination.
[INFO] org.slf4j:slf4j-simple:jar:1.7.25 already exists in destination.
[INFO] 
[INFO] --- assembly:2.5.5:single (default) @ rocksdb-binding ---
[WARNING] The following patterns were never triggered in this artifact exclusion filter:
o  '*:sources'

[INFO] Building tar: /Users/kkkzoz/Projects/kv-cache-research/ycsb-repo/rocksdb/target/ycsb-rocksdb-binding-0.17.0.tar.gz
[INFO] 
[INFO] --- dependency:2.10:list (default-cli) @ rocksdb-binding ---
[INFO] ------------------------------------------------------------------------
[INFO] Reactor Summary for YCSB Root 0.17.0:
[INFO] 
[INFO] YCSB Root .......................................... SUCCESS [  0.517 s]
[INFO] Core YCSB .......................................... SUCCESS [  0.822 s]
[INFO] Per Datastore Binding descriptor ................... SUCCESS [  0.052 s]
[INFO] YCSB Datastore Binding Parent ...................... SUCCESS [  0.122 s]
[INFO] RocksDB Java Binding ............................... SUCCESS [  1.096 s]
[INFO] ------------------------------------------------------------------------
[INFO] BUILD SUCCESS
[INFO] ------------------------------------------------------------------------
[INFO] Total time:  2.716 s
[INFO] Finished at: 2025-05-15T20:43:04+08:00
[INFO] ------------------------------------------------------------------------
[OVERALL], RunTime(ms), 292
[OVERALL], Throughput(ops/sec), 3424.6575342465753
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Concurrent_GC], Count, 0
[TOTAL_GC_TIME_G1_Concurrent_GC], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Concurrent_GC], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 512
[READ], AverageLatency(us), 5.861328125
[READ], MinLatency(us), 1
[READ], MaxLatency(us), 51
[READ], 95thPercentileLatency(us), 17
[READ], 99thPercentileLatency(us), 34
[READ], Return=OK, 512
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1094.0
[CLEANUP], MinLatency(us), 1094
[CLEANUP], MaxLatency(us), 1094
[CLEANUP], 95thPercentileLatency(us), 1094
[CLEANUP], 99thPercentileLatency(us), 1094
[UPDATE], Operations, 488
[UPDATE], AverageLatency(us), 25.389344262295083
[UPDATE], MinLatency(us), 9
[UPDATE], MaxLatency(us), 926
[UPDATE], 95thPercentileLatency(us), 78
[UPDATE], 99thPercentileLatency(us), 118
[UPDATE], Return=OK, 488